JosAlc67/DimecaProject/esp32_triple_as5600/Fase7_Integracion_Final/Fase7_Integracion_Final.ino
const uint32_t PWM_FREQ_HZ    = 20000;
const uint8_t  PWM_RES_BITS   = 8;
// 60 (~23%) resulto insuficiente para vencer la friccion estatica de los
// motores (no arrancaban). 255 (100%) si arranco, confirmado en pruebas.
// Duty minimo aceptado al calibrar velocidades (ver CALVEL mas abajo),
// para no terminar bajando tanto el duty de un motor rapido que deje de
// arrancar.
const uint8_t DUTY_MIN_SEGURO = 90;

// Duty por motor (ya no es un solo valor global): cada motor puede
// necesitar un duty distinto para girar a una velocidad real similar a
// los otros dos, dado que a igual duty no giran igual de rapido. Se
// inicializa en 150 (el valor validado antes de tener CALVEL) y se
// persiste en flash una vez calibrado.
uint8_t velocidadMotor[3] = {150, 150, 150};

int16_t cargarVelocidadMotor(uint8_t indice) {
  char clave[8];
  snprintf(clave, sizeof(clave), "vel%u", indice);
  prefs.begin(NVS_NAMESPACE, true);
  int16_t valor = prefs.getShort(clave, 150); // 150 = valor por defecto si nunca se calibro
  prefs.end();
  return valor;
}

void guardarVelocidadMotor(uint8_t indice, int16_t valor) {
  char clave[8];
  snprintf(clave, sizeof(clave), "vel%u", indice);
  prefs.begin(NVS_NAMESPACE, false);
  prefs.putShort(clave, valor);
  prefs.end();
}

const uint8_t PIN_RPWM[3] = {25, 27, 19};
const uint8_t PIN_LPWM[3] = {26, 18, 23};

#if !CORE_LEDC_V3
const uint8_t CANAL_RPWM[3] = {0, 2, 4};
const uint8_t CANAL_LPWM[3] = {1, 3, 5};
#endif

enum EstadoMotor { PARADO, ADELANTE, REVERSA };
EstadoMotor estadoMotor[3] = {PARADO, PARADO, PARADO};
uint8_t motorActivo = 0;

void configurarPWM(uint8_t pin, uint8_t canal) {
#if CORE_LEDC_V3
  ledcAttach(pin, PWM_FREQ_HZ, PWM_RES_BITS);
#else
  ledcSetup(canal, PWM_FREQ_HZ, PWM_RES_BITS);
  ledcAttachPin(pin, canal);
#endif
}

void escribirPWM(uint8_t pin, uint8_t canal, uint32_t duty) {
#if CORE_LEDC_V3
  ledcWrite(pin, duty);
#else
  ledcWrite(canal, duty);
#endif
}

uint8_t canalRPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_RPWM[m];
#endif
}
uint8_t canalLPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_LPWM[m];
#endif
}

// Posicion acumulada RAW (sin convertir a grados) del encoder emparejado
// con el motor `m` (mapeo confirmado 1-1, 2-2, 3-3).
int32_t leerPosicionAcumRaw(uint8_t m) {
  switch (m) {
    case 0: return as5600_1.getCumulativePosition(false);
    case 1: return as5600_2.getCumulativePosition(false);
    case 2: return posicionAcum3;
    default: return 0;
  }
}

// Guarda en flash la posicion acumulada actual del encoder del motor `m`,
// para poder restaurarla en el proximo arranque (ver setup()).
void guardarPosicionMotor(uint8_t m) {
  guardarPosicionAcum(m + 1, leerPosicionAcumRaw(m));
}

void detenerMotor(uint8_t m) {
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  estadoMotor[m] = PARADO;
  guardarPosicionMotor(m);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": DETENIDO");
}

void girarAdelante(uint8_t m) {
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  escribirPWM(PIN_RPWM[m], canalRPWM(m), velocidadMotor[m]);
  estadoMotor[m] = ADELANTE;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO ADELANTE (baja velocidad)");
}

void girarReversa(uint8_t m) {
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), velocidadMotor[m]);
  estadoMotor[m] = REVERSA;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO REVERSA (baja velocidad)");
}

// ---------------- CALVEL: calibracion de velocidad entre motores ----------------
//
// A igual duty, los 3 motores no giran necesariamente a la misma velocidad
// real (friccion, tolerancias de fabricacion, etc). CALVEL mide con el
// propio encoder cuantos grados/segundo gira cada motor a su duty actual,
// y ajusta el duty de cada uno (de forma proporcional, asumiendo relacion
// aproximadamente lineal duty<->velocidad en este rango) para que los 3
// terminen girando a una velocidad similar a la del motor mas lento -no
// se puede acelerar un motor mas alla de lo que ya da a duty 255, asi que
// siempre se iguala hacia abajo, nunca hacia arriba.
//
// Esto es calibracion de lazo abierto (se mide una vez, se fija un duty
// nuevo y listo) - no es control de velocidad en tiempo real ni PID.

// 3000ms (antes 1500ms): con una ventana corta, el transitorio de arranque
// (fraccion de segundo hasta alcanzar velocidad estable) pesa demasiado en
// la medicion y da resultados poco repetibles entre corridas (~10% de
// variacion observada en hardware con 1.5s). Una ventana mas larga diluye
// ese transitorio y promedia mejor cualquier variacion de corto plazo.
const uint32_t CALVEL_DURACION_MS = 3000;

// Gira el motor `m` hacia adelante durante `duracionMs` y devuelve la
// velocidad medida en grados/segundo (valor absoluto). Requiere que el
// motor este detenido antes de llamar.
//
// Usa un sondeo periodico (actualizarEncoders() cada 20ms) en vez de un
// solo delay() largo: si se usara un delay() bloqueante único con una
// ventana larga, y el motor llegara a girar mas de media vuelta durante
// esa espera, el algoritmo de deteccion de vuelta se confundiria (el
// mismo riesgo que ya se resolvio para loop() en general, aqui reaparece
// si la ventana de medicion es larga y no se refresca seguido).
float medirVelocidadGrados(uint8_t m, uint32_t duracionMs) {
  actualizarEncoders(); // asegura que "antes" sea una lectura fresca
  int32_t antes = leerPosicionAcumRaw(m);
  girarAdelante(m);

  uint32_t inicio = millis();
  while (millis() - inicio < duracionMs) {
    actualizarEncoders();
    delay(20);
  }

  detenerMotor(m);
  int32_t despues = leerPosicionAcumRaw(m);

  float gradosRecorridos = fabs((float)(despues - antes)) * (360.0f / 4096.0f);
  return gradosRecorridos / (duracionMs / 1000.0f);
}

void calibrarVelocidades() {
  for (uint8_t i = 0; i < 3; i++) {
    if (estadoMotor[i] != PARADO) {
      Serial.println("RECHAZADO: los 3 motores deben estar detenidos (S/SS) antes de CALVEL.");
      return;
    }
  }

  Serial.println("Calibrando velocidades... (gira cada motor por turnos, unos segundos)");

  float velocidad[3];
  for (uint8_t i = 0; i < 3; i++) {
    velocidad[i] = medirVelocidadGrados(i, CALVEL_DURACION_MS);
    Serial.print("Motor ");
    Serial.print(i + 1);
    Serial.print(": duty=");
    Serial.print(velocidadMotor[i]);
    Serial.print(" -> ");
    Serial.print(velocidad[i], 2);
    Serial.println(" deg/s medidos");
  }

  float velocidadObjetivo = velocidad[0];
  for (uint8_t i = 1; i < 3; i++) {
    if (velocidad[i] < velocidadObjetivo) velocidadObjetivo = velocidad[i];
  }

